Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.ExactSpacing.Validation Enumeration
 Defines values used in validation of exact spacing elements.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum Validation
Public Enumeration Validation
Members
Member name | Value | Description
VALID | 0 |  The elements are valid.
EMPTY | 1 |  There are no elements.
ZERO_ELEMENTS | 2 |  Contains elements with zero number or distance.
NEGATIVE_ELEMENTS | 3 |  Contains elements with negative number or distance.
See Also
Reference
Tekla.Structures.Model Namespace